---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.DesignOptionCannotReference
source: html/4f7699a6-c73f-3603-9067-81d94b6e6689.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures.DesignOptionCannotReference Property

Design Option ' [Name] ' cannot reference Design Option ' [Name] '.

## Syntax (C#)
```csharp
public static FailureDefinitionId DesignOptionCannotReference { get; }
```